riverdi/riverdi-50-stm32u5-lvgl/riverdi-50-stm32u5-lvgl.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_11
ADC1.CommonPathInternal=null|null|ADC_CHANNEL_VBAT|null
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,MonitoredBy-0\#ChannelRegularConversion,NbrOfConversionFlag,master,SingleDiff-0\#ChannelRegularConversion,CommonPathInternal
ADC1.MonitoredBy-0\#ChannelRegularConversion=__NULL
ADC1.NbrOfConversionFlag=1
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.Rank-0\#ChannelRegularConversion=1
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_5CYCLE
ADC1.SingleDiff-0\#ChannelRegularConversion=ADC_DIFFERENTIAL_ENDED
ADC1.master=1
ADC2.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_VREFINT
ADC2.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,MonitoredBy-0\#ChannelRegularConversion,NbrOfConversionFlag
ADC2.MonitoredBy-0\#ChannelRegularConversion=__NULL
ADC2.NbrOfConversionFlag=1
ADC2.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC2.Rank-0\#ChannelRegularConversion=1
ADC2.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_5CYCLE
CAD.formats=
CAD.pinconfig=
CAD.provider=
CORTEX_M33_NS.AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_PRIV_RO
CORTEX_M33_NS.AllocateAttribute-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_R_ALLOCATE
CORTEX_M33_NS.AllocateAttribute-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_RW_ALLOCATE
CORTEX_M33_NS.AttributesIndex-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_ATTRIBUTES_NUMBER1
CORTEX_M33_NS.BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings=0x08000000
CORTEX_M33_NS.BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings=0x20000000
CORTEX_M33_NS.CacheableAttribute-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_WRITE_BACK
CORTEX_M33_NS.Enable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_ENABLE
CORTEX_M33_NS.Enable-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_ENABLE
CORTEX_M33_NS.IPParameters=MPU_Control,Enable-Cortex_Memory_Protection_Unit_Region0_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings,LimitAddress-Cortex_Memory_Protection_Unit_Region0_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings,AllocateAttribute-Cortex_Memory_Protection_Unit_Region0_Settings,Enable-Cortex_Memory_Protection_Unit_Region1_Settings,Number-Cortex_Memory_Protection_Unit_Region1_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings,LimitAddress-Cortex_Memory_Protection_Unit_Region1_Settings,AttributesIndex-Cortex_Memory_Protection_Unit_Region1_Settings,CacheableAttribute-Cortex_Memory_Protection_Unit_Region1_Settings,AllocateAttribute-Cortex_Memory_Protection_Unit_Region1_Settings
CORTEX_M33_NS.LimitAddress-Cortex_Memory_Protection_Unit_Region0_Settings=0x083FFFFF
CORTEX_M33_NS.LimitAddress-Cortex_Memory_Protection_Unit_Region1_Settings=0x2026FFFF
CORTEX_M33_NS.MPU_Control=__NULL
CORTEX_M33_NS.Number-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_NUMBER1
CORTEX_M33_NS.userName=CORTEX_M33
DAC1.DAC_Channel-DAC_OUT1=DAC_CHANNEL_1
DAC1.DAC_Channel-DAC_OUT2=DAC_CHANNEL_2
DAC1.IPParameters=DAC_Channel-DAC_OUT1,DAC_Channel-DAC_OUT2
DMA2D.ColorMode=DMA2D_OUTPUT_RGB565
DMA2D.IPParameters=ColorMode
FDCAN1.CalculateBaudRateNominal=2000000
FDCAN1.CalculateTimeBitNominal=500
FDCAN1.CalculateTimeQuantumNominal=100.0
FDCAN1.FrameFormat=FDCAN_FRAME_FD_BRS
FDCAN1.IPParameters=CalculateTimeQuantumNominal,CalculateTimeBitNominal,CalculateBaudRateNominal,FrameFormat
FLASH.B1_BLOCK_active=true
FLASH.B1_endPage=255
FLASH.B2_BLOCK_active=true
FLASH.B2_Bank=FLASH_BANK_2
FLASH.B2_endPage=255
FLASH.IPParameters=B1_BLOCK_active,B1_endPage,B2_BLOCK_active,B2_endPage,B2_Bank
File.Version=6
GPIO.groupedBy=Group By Peripherals
GTZC.IPParameters=MPCBB1_Area_Privilege_Choice,MPCBB1_Area_Privilege,MPCBB2_Area_Privilege_Choice,MPCBB2_Area_Privilege_Start_Address,MPCBB2_Area2_Privilege_Start_Address,MPCBB2_Area_Privilege,MPCBB3_Area_Privilege_Choice,MPCBB3_Area_Privilege_Start_Address,MPCBB3_Area2_Privilege_Start_Address,MPCBB3_Area_Privilege,MPCBB5_Area_Privilege_Choice,MPCBB5_Area_Privilege_Start_Address,MPCBB5_Area_Privilege,MPCBB1_SecConfig_array,MPCBB2_SecConfig_array,MPCBB3_SecConfig_array,MPCBB4_SecConfig_array,MPCBB4_PrivConfig_array,MPCBB5_SecConfig_array
GTZC.MPCBB1_Area_Privilege=GTZC_MPCBB_REGION_NPRIV
GTZC.MPCBB1_Area_Privilege_Choice=from full Privileged
GTZC.MPCBB1_SecConfig_array=00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000
GTZC.MPCBB2_Area2_Privilege_Start_Address=0x200C0000
GTZC.MPCBB2_Area_Privilege=GTZC_MPCBB_REGION_NPRIV
GTZC.MPCBB2_Area_Privilege_Choice=from full Privileged
GTZC.MPCBB2_Area_Privilege_Start_Address=0x200C0000
GTZC.MPCBB2_SecConfig_array=00000000\:00000000\:00000000\:00000000
GTZC.MPCBB3_Area2_Privilege_Start_Address=0x200D0000
GTZC.MPCBB3_Area_Privilege=GTZC_MPCBB_REGION_NPRIV
GTZC.MPCBB3_Area_Privilege_Choice=from full Privileged
GTZC.MPCBB3_Area_Privilege_Start_Address=0x200D0000
GTZC.MPCBB3_SecConfig_array=00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000
GTZC.MPCBB4_PrivConfig_array=00000000
GTZC.MPCBB4_SecConfig_array=00000000
GTZC.MPCBB5_Area_Privilege=GTZC_MPCBB_REGION_NPRIV
GTZC.MPCBB5_Area_Privilege_Choice=from full Privileged
GTZC.MPCBB5_Area_Privilege_Start_Address=0x201A0000
GTZC.MPCBB5_SecConfig_array=00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000\:00000000
I2C1.IPParameters=Timing
I2C1.Timing=0x30909DEC
I2C2.IPParameters=Timing
I2C2.Timing=0x30909DEC
I2C4.IPParameters=Timing
I2C4.Timing=0x30909DEC
KeepUserPlacement=false
LTDC.ActiveW=800
LTDC.Alpha_L0=255
LTDC.FBStartAdress_L0=0x20000000
LTDC.HBP=8
LTDC.HFP=8
LTDC.HSync=4
LTDC.IPParameters=Layers,PixelFormat_L0,Alpha_L0,FBStartAdress_L0,ImageWidth_L0,ImageHeight_L0,WindowX1_L0,WindowY1_L0,ActiveW,HSync,HBP,HFP,VBP,VFP
LTDC.ImageHeight_L0=480
LTDC.ImageWidth_L0=800
LTDC.Layers=0
LTDC.PixelFormat_L0=LTDC_PIXEL_FORMAT_RGB565
LTDC.VBP=8
LTDC.VFP=8
LTDC.WindowX1_L0=800
LTDC.WindowY1_L0=480
MMTAppReg1.MEMORYMAP.AP=RW_priv_only
MMTAppReg1.MEMORYMAP.AppRegionName=RAM
MMTAppReg1.MEMORYMAP.ContextName=CortexM33
MMTAppReg1.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg1.MEMORYMAP.DefaultDataRegion=true
MMTAppReg1.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,AP
MMTAppReg1.MEMORYMAP.Name=RAM
MMTAppReg1.MEMORYMAP.Size=1787904
MMTAppReg1.MEMORYMAP.StartAddress=0x200BB800
MMTAppReg2.MEMORYMAP.AppRegionName=RAM Reserved Alias Region
MMTAppReg2.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg2.MEMORYMAP.DefaultDataRegion=false
MMTAppReg2.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ReservedRegion,Name
MMTAppReg2.MEMORYMAP.Name=RAM Reserved Alias Region
MMTAppReg2.MEMORYMAP.ReservedRegion=true
MMTAppReg2.MEMORYMAP.Size=1787904
MMTAppReg2.MEMORYMAP.StartAddress=0xa0bb800
MMTAppReg3.MEMORYMAP.AP=RO_priv_only
MMTAppReg3.MEMORYMAP.AppRegionName=FLASH
MMTAppReg3.MEMORYMAP.Cacheability=WTRA
MMTAppReg3.MEMORYMAP.ContextName=CortexM33
MMTAppReg3.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg3.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg3.MEMORYMAP.DefaultDataRegion=false
MMTAppReg3.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,MemType,ContextName,Name,AP,Cacheability,DefaultCodeRegion
MMTAppReg3.MEMORYMAP.MemType=ROM
MMTAppReg3.MEMORYMAP.Name=FLASH
MMTAppReg3.MEMORYMAP.Size=4194304
MMTAppReg3.MEMORYMAP.StartAddress=0x08000000
MMTAppReg4.MEMORYMAP.AP=RW_priv_only
MMTAppReg4.MEMORYMAP.AppRegionName=RAM2
MMTAppReg4.MEMORYMAP.ContextName=CortexM33
MMTAppReg4.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg4.MEMORYMAP.DefaultDataRegion=false
MMTAppReg4.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,AP
MMTAppReg4.MEMORYMAP.Name=RAM2
MMTAppReg4.MEMORYMAP.Size=768000
MMTAppReg4.MEMORYMAP.StartAddress=0x20000000
MMTAppReg5.MEMORYMAP.AppRegionName=RAM2 Reserved Alias Region
MMTAppReg5.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg5.MEMORYMAP.DefaultDataRegion=false
MMTAppReg5.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ReservedRegion,Name
MMTAppReg5.MEMORYMAP.Name=FB Reserved Alias Region
MMTAppReg5.MEMORYMAP.ReservedRegion=true
MMTAppReg5.MEMORYMAP.Size=768000
MMTAppReg5.MEMORYMAP.StartAddress=0x0A000000
MMTAppRegionsCount=5
MMTConfigApplied=false
MMTProjectManagerApplied=true
Mcu.CPN=STM32U599NJH6Q
Mcu.ContextProject=TrustZoneDisabled
Mcu.Family=STM32U5
Mcu.IP0=ADC1
Mcu.IP1=ADC2
Mcu.IP10=DMA2D
Mcu.IP11=FDCAN1
Mcu.IP12=FLASH
Mcu.IP13=GPU2D
Mcu.IP14=GTZC
Mcu.IP15=HASH
Mcu.IP16=I2C1
Mcu.IP17=I2C2
Mcu.IP18=I2C4
Mcu.IP19=ICACHE
Mcu.IP2=ADF1
Mcu.IP20=LPBAM
Mcu.IP21=LPBAMQUEUE
Mcu.IP22=LPTIM2
Mcu.IP23=LTDC
Mcu.IP24=MEMORYMAP
Mcu.IP25=NVIC
Mcu.IP26=OCTOSPI1
Mcu.IP27=PWR
Mcu.IP28=RCC
Mcu.IP29=RNG
Mcu.IP3=CORDIC
Mcu.IP30=RTC
Mcu.IP31=SDMMC1
Mcu.IP32=SPI1
Mcu.IP33=SPI2
Mcu.IP34=SYS
Mcu.IP35=TIM1
Mcu.IP36=TIM3
Mcu.IP37=TIM5
Mcu.IP38=TIM6
Mcu.IP39=TIM8
Mcu.IP4=CORTEX_M33_NS
Mcu.IP40=TIM15
Mcu.IP41=USART1
Mcu.IP42=USART2
Mcu.IP43=USART3
Mcu.IP44=USART6
Mcu.IP45=USB_OTG_HS
Mcu.IP5=CRC
Mcu.IP6=DAC1
Mcu.IP7=DCACHE1
Mcu.IP8=DCACHE2
Mcu.IP9=DEBUG
Mcu.IPNb=46
Mcu.Name=STM32U599NJHxQ
Mcu.Package=TFBGA216
Mcu.Pin0=PE0
Mcu.Pin1=PB7
Mcu.Pin10=PC14-OSC32_IN (PC14)
Mcu.Pin100=PB15
Mcu.Pin101=VP_ADC1_Vbat_Input
Mcu.Pin102=VP_ADC2_Vref_Input
Mcu.Pin103=VP_CORDIC_VS_CORDIC
Mcu.Pin104=VP_CRC_VS_CRC
Mcu.Pin105=VP_DCACHE1_VS_DCACHE
Mcu.Pin106=VP_DCACHE2_VS_DCACHE
Mcu.Pin107=VP_DMA2D_VS_DMA2D
Mcu.Pin108=VP_FLASH_SIG_Activate_FlashIP
Mcu.Pin109=VP_GPU2D_VS_GPU2D
Mcu.Pin11=PE1
Mcu.Pin110=VP_GTZC_VS_GTZC_Enable
Mcu.Pin111=VP_HASH_VS_HASH
Mcu.Pin112=VP_ICACHE_VS_ICACHE
Mcu.Pin113=VP_LPBAMQUEUE_VS_QUEUE
Mcu.Pin114=VP_OCTOSPI1_VS_octo
Mcu.Pin115=VP_PWR_V_PVD_IN
Mcu.Pin116=VP_PWR_VS_DBSignals
Mcu.Pin117=VP_PWR_VS_SECSignals
Mcu.Pin118=VP_PWR_VS_LPOM
Mcu.Pin119=VP_RNG_VS_RNG
Mcu.Pin12=PB5
Mcu.Pin120=VP_RTC_VS_RTC_Activate
Mcu.Pin121=VP_RTC_VS_RTC_Calendar
Mcu.Pin122=VP_SYS_VS_tim2
Mcu.Pin123=VP_TIM6_VS_ClockSourceINT
Mcu.Pin124=VP_TIM15_VS_ClockSourceINT
Mcu.Pin125=VP_LPBAM_VS_SIG1
Mcu.Pin126=VP_LPBAM_VS_SIG4
Mcu.Pin127=VP_MEMORYMAP_VS_MEMORYMAP
Mcu.Pin128=VP_STMicroelectronics.X-CUBE-FREERTOS_VS_CMSISJjRTOS2_10.4.6_1.0.1
Mcu.Pin13=PG13
Mcu.Pin14=PD5
Mcu.Pin15=PD2
Mcu.Pin16=PC11
Mcu.Pin17=PH7
Mcu.Pin18=PH5
Mcu.Pin19=PA12
Mcu.Pin2=PB6
Mcu.Pin20=PA11
Mcu.Pin21=PC7
Mcu.Pin22=PC15-OSC32_OUT (PC15)
Mcu.Pin23=PE3
Mcu.Pin24=PB9
Mcu.Pin25=PB8
Mcu.Pin26=PD1
Mcu.Pin27=PC12
Mcu.Pin28=PH4
Mcu.Pin29=PA13 (JTMS/SWDIO)
Mcu.Pin3=PG9
Mcu.Pin30=PC9
Mcu.Pin31=PI6
Mcu.Pin32=PB4 (NJTRST)
Mcu.Pin33=PG14
Mcu.Pin34=PD0
Mcu.Pin35=PA10
Mcu.Pin36=PG6
Mcu.Pin37=PG3
Mcu.Pin38=PJ4
Mcu.Pin39=PE6
Mcu.Pin4=PD4
Mcu.Pin40=PE2
Mcu.Pin41=PG8
Mcu.Pin42=PJ0
Mcu.Pin43=PC13
Mcu.Pin44=PG4
Mcu.Pin45=PG2
Mcu.Pin46=PI1
Mcu.Pin47=PI2
Mcu.Pin48=PI3
Mcu.Pin49=PF4
Mcu.Pin5=PD3
Mcu.Pin50=PF3
Mcu.Pin51=PD15
Mcu.Pin52=PI0
Mcu.Pin53=PF10
Mcu.Pin54=PF7
Mcu.Pin55=PF9
Mcu.Pin56=PD11
Mcu.Pin57=PC1
Mcu.Pin58=PF6
Mcu.Pin59=PF8
Mcu.Pin6=PC10
Mcu.Pin60=PA2
Mcu.Pin61=PA4
Mcu.Pin62=PB1
Mcu.Pin63=PF13
Mcu.Pin64=PE8
Mcu.Pin65=PE13
Mcu.Pin66=PB11
Mcu.Pin67=PD12
Mcu.Pin68=PH0-OSC_IN (PH0)
Mcu.Pin69=PC3
Mcu.Pin7=PA14 (JTCK/SWCLK)
Mcu.Pin70=PA0
Mcu.Pin71=PB0
Mcu.Pin72=PF12
Mcu.Pin73=PG1
Mcu.Pin74=PE7
Mcu.Pin75=PE15
Mcu.Pin76=PE12
Mcu.Pin77=PB10
Mcu.Pin78=PD8
Mcu.Pin79=PD13
Mcu.Pin8=PA8
Mcu.Pin80=PD14
Mcu.Pin81=PC2
Mcu.Pin82=PC0
Mcu.Pin83=PA1
Mcu.Pin84=PA3
Mcu.Pin85=PA6
Mcu.Pin86=PC5
Mcu.Pin87=PF11
Mcu.Pin88=PF15
Mcu.Pin89=PE9
Mcu.Pin9=PC8
Mcu.Pin90=PE10
Mcu.Pin91=PE11
Mcu.Pin92=PB14
Mcu.Pin93=PD10
Mcu.Pin94=PD9
Mcu.Pin95=PA5
Mcu.Pin96=PA7
Mcu.Pin97=PC4
Mcu.Pin98=PF14
Mcu.Pin99=PE14
Mcu.PinsNb=129
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-FREERTOS.1.0.1
Mcu.ThirdParty1=STMicroelectronics.X-CUBE-TOUCHGFX.4.22.0
Mcu.ThirdPartyNb=2
Mcu.UserConstants=
Mcu.UserName=STM32U599NJHxQ
MxCube.Version=6.9.1
MxDb.Version=DB.6.0.91
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.DMA2D_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.EXTI6_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC.ForceEnableDMAVector=true
NVIC.GPU2D_ER_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true\:true
NVIC.GPU2D_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true\:true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.LTDC_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false\:false
NVIC.SavedPendsvIrqHandlerGenerated=true
NVIC.SavedSvcallIrqHandlerGenerated=true
NVIC.SavedSystickIrqHandlerGenerated=true
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:true\:false
NVIC.TIM2_IRQn=true\:15\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.TimeBase=TIM2_IRQn
NVIC.TimeBaseIP=TIM2
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
OCTOSPI1.ChipSelectHighTime=2
OCTOSPI1.ClockPrescaler=2
OCTOSPI1.DelayHoldQuarterCycle=HAL_OSPI_DHQC_ENABLE
OCTOSPI1.FifoThreshold=4
OCTOSPI1.IPParameters=MemoryType,FifoThreshold,ChipSelectHighTime,ClockPrescaler,DelayHoldQuarterCycle
OCTOSPI1.MemoryType=HAL_OSPI_MEMTYPE_MACRONIX
PA0.Locked=true
PA0.Mode=CTS_RTS
PA0.Signal=USART2_CTS
PA1.Locked=true
PA1.Mode=OCTOSPI1_Port1_DQS
PA1.Signal=OCTOSPIM_P1_DQS
PA10.GPIOParameters=GPIO_Speed
PA10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PA10.Locked=true
PA10.Mode=OTG/Dual-Role-Device-HS
PA10.Signal=USB_OTG_HS_ID
PA11.GPIOParameters=GPIO_Speed
PA11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PA11.Locked=true
PA11.Mode=OTG/Dual-Role-Device-HS
PA11.Signal=USB_OTG_HS_DM
PA12.GPIOParameters=GPIO_Speed
PA12.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PA12.Locked=true
PA12.Mode=OTG/Dual-Role-Device-HS
PA12.Signal=USB_OTG_HS_DP
PA13\ (JTMS/SWDIO).Locked=true
PA13\ (JTMS/SWDIO).Mode=Serial_Wire
PA13\ (JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
PA14\ (JTCK/SWCLK).Locked=true
PA14\ (JTCK/SWCLK).Mode=Serial_Wire
PA14\ (JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PA2.Locked=true
PA2.Mode=OCTOSPI1_Port1_NCS
PA2.Signal=OCTOSPIM_P1_NCS
PA3.Locked=true
PA3.Mode=Asynchronous
PA3.Signal=USART2_RX
PA4.Locked=true
PA4.Signal=COMP_DAC11_group
PA5.Locked=true
PA5.Signal=COMP_DAC12_group
PA6.Locked=true
PA6.Mode=IN11-Differential
PA6.Signal=ADC1_IN11
PA7.Locked=true
PA7.Mode=IN11-Differential
PA7.Signal=ADC1_IN12
PA8.Locked=true
PA8.Mode=Clock-out
PA8.Signal=RCC_MCO
PB0.Mode=Output Compare2 CH2N
PB0.Signal=TIM1_CH2N
PB1.Locked=true
PB1.Mode=Encoder_mode_occur1
PB1.Signal=LPTIM2_IN1
PB10.Locked=true
PB10.Mode=Asynchronous
PB10.Signal=USART3_TX
PB11.GPIOParameters=GPIO_Speed
PB11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB11.Locked=true
PB11.Mode=I2C
PB11.Signal=I2C4_SDA
PB14.Locked=true
PB14.Signal=S_TIM15_CH1
PB15.Locked=true
PB15.Mode=Encoder_mode_occur1
PB15.Signal=LPTIM2_IN2
PB4\ (NJTRST).Locked=true
PB4\ (NJTRST).Mode=MOD_ADF_CCK
PB4\ (NJTRST).Signal=ADF1_SDI0
PB5.Locked=true
PB5.Mode=WakeUp6
PB5.Signal=PWR_WKUP6
PB6.GPIOParameters=GPIO_Speed
PB6.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB6.Locked=true
PB6.Mode=I2C
PB6.Signal=I2C4_SCL
PB7.Locked=true
PB7.Mode=Asynchronous
PB7.Signal=USART1_RX
PB8.GPIOParameters=GPIO_Speed
PB8.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB8.Locked=true
PB8.Mode=FDCAN_Activate
PB8.Signal=FDCAN1_RX
PB9.GPIOParameters=GPIO_Speed
PB9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB9.Locked=true
PB9.Mode=FDCAN_Activate
PB9.Signal=FDCAN1_TX
PC0.Locked=true
PC0.Mode=OCTOSPI1_IOH_Port1H
PC0.Signal=OCTOSPIM_P1_IO7
PC1.Locked=true
PC1.Mode=OCTOSPI1_IOH_Port1H
PC1.Signal=OCTOSPIM_P1_IO4
PC10.GPIOParameters=GPIO_Speed_High_Only
PC10.GPIO_Speed_High_Only=GPIO_SPEED_FREQ_VERY_HIGH
PC10.Locked=true
PC10.Mode=SD_4_bits_Wide_bus
PC10.Signal=SDMMC1_D2
PC11.GPIOParameters=GPIO_Speed_High_Only
PC11.GPIO_Speed_High_Only=GPIO_SPEED_FREQ_VERY_HIGH
PC11.Locked=true
PC11.Mode=SD_4_bits_Wide_bus
PC11.Signal=SDMMC1_D3
PC12.GPIOParameters=GPIO_Speed_High_Only
PC12.GPIO_Speed_High_Only=GPIO_SPEED_FREQ_VERY_HIGH
PC12.Locked=true
PC12.Mode=SD_4_bits_Wide_bus
PC12.Signal=SDMMC1_CK
PC13.Locked=true
PC13.Mode=AlarmA_RoutedAF
PC13.Signal=RTC_OUT1
PC14-OSC32_IN\ (PC14).Locked=true
